# Python Libraries

In [86]:
data = {
    'Orange': ['Kashmir', 'Ooty', 'BGLR'],
    'Apple': ['Chennai', 'Pune']
}

In [87]:
import pandas as pd

In [88]:
print(data)

{'Orange': ['Kashmir', 'Ooty', 'BGLR'], 'Apple': ['Chennai', 'Pune']}

In [89]:
#Creating Dataframes
df1 = pd.DataFrame({k: data[k] for k in list(data.keys())[0:1]})

In [90]:
df1

    Orange
0  Kashmir
1     Ooty
2     BGLR

In [91]:
#Creating Dataframes
df2 = pd.DataFrame({k: data[k] for k in list(data.keys())[1:2]})

In [92]:
df2

     Apple
0  Chennai
1     Pune

In [94]:
df = pd.concat([df1, df2], axis=1)
print("The dataframe is: \n")
df

The dataframe is:

    Orange    Apple
0  Kashmir  Chennai
1     Ooty     Pune
2     BGLR      NaN

In [97]:
df.head(1)

    Orange    Apple
0  Kashmir  Chennai

In [98]:
type(df)

pandas.core.frame.DataFrame

In [99]:
df.shape

(3, 2)

In [100]:
df.tail(1)

  Orange Apple
2   BGLR   NaN

In [101]:
new_df = df1 + df2

In [102]:
new_df

  Apple Orange
0   NaN    NaN
1   NaN    NaN
2   NaN    NaN

In [70]:
type(new_df)

pandas.core.frame.DataFrame